/**************************************
*** git 常用快捷命令***
mkdir             -- 创建一个文件夹
pwd               -- 查看当前路径
git init          -- 创建git目录仓库
ls －ah           -- 查看含有.的文件夹等方式
git add           -- 将文件添加到仓库中
git commit -m ""  -- 将文件提交到仓库并添加注释
git diff          -- 查看当前文件的变化
git status        -- 查看当前仓库的状态
***************************************/

/***************************************
*** vi编辑器使用常用快捷键***
:w                -- 保存文件但不退出vi
:w file           -- 将修改另外保存到file中，不退出vi
:w!               -- 强制保存，不推出vi
:wq               -- 保存文件并退出vi
:wq!              -- 强制保存文件，并退出vi
q:                -- 不保存文件，退出vi
:q!               -- 不保存文件，强制退出vi
:e!               -- 放弃所有修改，从上次保存文件开始再编辑
****************************************/

